

ban_choice = (
    (0, "Активный"),
    (1, "В бане"),
)

yes_choice = (
    (0, 'Нет'),
    (1, 'Да',)
)

payment_type = (
    (0, "QIWI кошелёк"),
    (1, "Яндекс Деньги"),
    (2, "WebMoney кошелёк"),
    (3, "Бонусы"),
)

payment_status = (
    (0, "Неоплаченный"),
    (1, "В обработке"),
    (2, "Оплачен"),
)

promocode_status = (
    (0, 'Действующий'),
    (1, 'Использован'),
    (2, 'Отложен в архив')
)

announce_type = (
    (0, 'Реклама'),
    (1, 'Продажа'),
)

announce_object_type = (
    (0, 'Канал'),
    (1, 'Группа'),
    (2, 'Бот'),
)

discount_percent = (
    (0, "10%"),
    (1, "10%"),
    (2, "20%"),
    (3, "30%"),
    (4, "40%"),
    (5, "50%"),
    (6, "60%"),
    (7, "70%"),
    (8, "80%"),
    (9, "90%"),
)

top_time = (
    (0, "1ч"),
    (1, "2ч"),
    (2, "3ч"),
    (3, "4ч"),
    (4, "5ч"),
    (5, "6ч"),
    (6, "12ч"),
    )
tape_time = (
    (0, "24ч"),
    (1, "36ч"),
    (2, "48ч"),
    (3, "52ч"),
    (4, "72ч"),
    (5, "Неделя"),
    (6, "Вечно"),
)

MAIN_ACTIONS = (
    (1, "Продать рекламу в группе"),
    (2, "Продать рекламу в канале"),
    (3, "Продать рекламу в боте"),
    (4, "Продать канал"),
    (5, "Продать бота"),
)

